GopalSaraf/Practicals/PSDL/include/proc/pic18lf4550.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF4550_INC_
#define _PIC18LF4550_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF4550
 */

/*
 * Device Registers
 */

// Register: SPPDATA
#define SPPDATA SPPDATA
SPPDATA                                  equ 0F62h
// bitfield definitions
SPPDATA_DATA_POSN                        equ 0000h
SPPDATA_DATA_POSITION                    equ 0000h
SPPDATA_DATA_SIZE                        equ 0008h
SPPDATA_DATA_LENGTH                      equ 0008h
SPPDATA_DATA_MASK                        equ 00FFh

// Register: SPPCFG
#define SPPCFG SPPCFG
SPPCFG                                   equ 0F63h
// bitfield definitions
SPPCFG_WS_POSN                           equ 0000h
SPPCFG_WS_POSITION                       equ 0000h
SPPCFG_WS_SIZE                           equ 0004h
SPPCFG_WS_LENGTH                         equ 0004h
SPPCFG_WS_MASK                           equ 000Fh
SPPCFG_CLK1EN_POSN                       equ 0004h
SPPCFG_CLK1EN_POSITION                   equ 0004h
SPPCFG_CLK1EN_SIZE                       equ 0001h
SPPCFG_CLK1EN_LENGTH                     equ 0001h
SPPCFG_CLK1EN_MASK                       equ 0010h
SPPCFG_CSEN_POSN                         equ 0005h
SPPCFG_CSEN_POSITION                     equ 0005h
SPPCFG_CSEN_SIZE                         equ 0001h
SPPCFG_CSEN_LENGTH                       equ 0001h
SPPCFG_CSEN_MASK                         equ 0020h
SPPCFG_CLKCFG_POSN                       equ 0006h
SPPCFG_CLKCFG_POSITION                   equ 0006h
SPPCFG_CLKCFG_SIZE                       equ 0002h
SPPCFG_CLKCFG_LENGTH                     equ 0002h
SPPCFG_CLKCFG_MASK                       equ 00C0h
SPPCFG_WS0_POSN                          equ 0000h
SPPCFG_WS0_POSITION                      equ 0000h
SPPCFG_WS0_SIZE                          equ 0001h
SPPCFG_WS0_LENGTH                        equ 0001h
SPPCFG_WS0_MASK                          equ 0001h
SPPCFG_WS1_POSN                          equ 0001h
SPPCFG_WS1_POSITION                      equ 0001h
SPPCFG_WS1_SIZE                          equ 0001h
SPPCFG_WS1_LENGTH                        equ 0001h
SPPCFG_WS1_MASK                          equ 0002h
SPPCFG_WS2_POSN                          equ 0002h
SPPCFG_WS2_POSITION                      equ 0002h
SPPCFG_WS2_SIZE                          equ 0001h
SPPCFG_WS2_LENGTH                        equ 0001h
SPPCFG_WS2_MASK                          equ 0004h
SPPCFG_WS3_POSN                          equ 0003h
SPPCFG_WS3_POSITION                      equ 0003h
SPPCFG_WS3_SIZE                          equ 0001h
SPPCFG_WS3_LENGTH                        equ 0001h
SPPCFG_WS3_MASK                          equ 0008h
SPPCFG_CLKCFG0_POSN                      equ 0006h
SPPCFG_CLKCFG0_POSITION                  equ 0006h
SPPCFG_CLKCFG0_SIZE                      equ 0001h
SPPCFG_CLKCFG0_LENGTH                    equ 0001h
SPPCFG_CLKCFG0_MASK                      equ 0040h
SPPCFG_CLKCFG1_POSN                      equ 0007h
SPPCFG_CLKCFG1_POSITION                  equ 0007h
SPPCFG_CLKCFG1_SIZE                      equ 0001h
SPPCFG_CLKCFG1_LENGTH                    equ 0001h
SPPCFG_CLKCFG1_MASK                      equ 0080h

// Register: SPPEPS
#define SPPEPS SPPEPS
SPPEPS                                   equ 0F64h
// bitfield definitions
SPPEPS_ADDR_POSN                         equ 0000h
SPPEPS_ADDR_POSITION                     equ 0000h
SPPEPS_ADDR_SIZE                         equ 0004h
SPPEPS_ADDR_LENGTH                       equ 0004h
SPPEPS_ADDR_MASK                         equ 000Fh
SPPEPS_SPPBUSY_POSN                      equ 0004h
SPPEPS_SPPBUSY_POSITION                  equ 0004h
SPPEPS_SPPBUSY_SIZE                      equ 0001h
SPPEPS_SPPBUSY_LENGTH                    equ 0001h
SPPEPS_SPPBUSY_MASK                      equ 0010h
SPPEPS_WRSPP_POSN                        equ 0006h
SPPEPS_WRSPP_POSITION                    equ 0006h
SPPEPS_WRSPP_SIZE                        equ 0001h
SPPEPS_WRSPP_LENGTH                      equ 0001h
SPPEPS_WRSPP_MASK                        equ 0040h
SPPEPS_RDSPP_POSN                        equ 0007h
SPPEPS_RDSPP_POSITION                    equ 0007h
SPPEPS_RDSPP_SIZE                        equ 0001h
SPPEPS_RDSPP_LENGTH                      equ 0001h
SPPEPS_RDSPP_MASK                        equ 0080h
SPPEPS_ADDR0_POSN                        equ 0000h
SPPEPS_ADDR0_POSITION                    equ 0000h
SPPEPS_ADDR0_SIZE                        equ 0001h
SPPEPS_ADDR0_LENGTH                      equ 0001h
SPPEPS_ADDR0_MASK                        equ 0001h
SPPEPS_ADDR1_POSN                        equ 0001h
SPPEPS_ADDR1_POSITION                    equ 0001h
SPPEPS_ADDR1_SIZE                        equ 0001h
SPPEPS_ADDR1_LENGTH                      equ 0001h
SPPEPS_ADDR1_MASK                        equ 0002h
SPPEPS_ADDR2_POSN                        equ 0002h
SPPEPS_ADDR2_POSITION                    equ 0002h
SPPEPS_ADDR2_SIZE                        equ 0001h
SPPEPS_ADDR2_LENGTH                      equ 0001h
SPPEPS_ADDR2_MASK                        equ 0004h
SPPEPS_ADDR3_POSN                        equ 0003h
SPPEPS_ADDR3_POSITION                    equ 0003h
SPPEPS_ADDR3_SIZE                        equ 0001h
SPPEPS_ADDR3_LENGTH                      equ 0001h
SPPEPS_ADDR3_MASK                        equ 0008h
SPPEPS_BUSY_POSN                         equ 0004h
SPPEPS_BUSY_POSITION                     equ 0004h
SPPEPS_BUSY_SIZE                         equ 0001h
SPPEPS_BUSY_LENGTH                       equ 0001h
SPPEPS_BUSY_MASK                         equ 0010h

