GopalSaraf/Practicals/PSDL/include/proc/pic18lf4550.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_SPP0_POSN                          equ 0000h
PORTD_SPP0_POSITION                      equ 0000h
PORTD_SPP0_SIZE                          equ 0001h
PORTD_SPP0_LENGTH                        equ 0001h
PORTD_SPP0_MASK                          equ 0001h
PORTD_SPP1_POSN                          equ 0001h
PORTD_SPP1_POSITION                      equ 0001h
PORTD_SPP1_SIZE                          equ 0001h
PORTD_SPP1_LENGTH                        equ 0001h
PORTD_SPP1_MASK                          equ 0002h
PORTD_SPP2_POSN                          equ 0002h
PORTD_SPP2_POSITION                      equ 0002h
PORTD_SPP2_SIZE                          equ 0001h
PORTD_SPP2_LENGTH                        equ 0001h
PORTD_SPP2_MASK                          equ 0004h
PORTD_SPP3_POSN                          equ 0003h
PORTD_SPP3_POSITION                      equ 0003h
PORTD_SPP3_SIZE                          equ 0001h
PORTD_SPP3_LENGTH                        equ 0001h
PORTD_SPP3_MASK                          equ 0008h
PORTD_SPP4_POSN                          equ 0004h
PORTD_SPP4_POSITION                      equ 0004h
PORTD_SPP4_SIZE                          equ 0001h
PORTD_SPP4_LENGTH                        equ 0001h
PORTD_SPP4_MASK                          equ 0010h
PORTD_SPP5_POSN                          equ 0005h
PORTD_SPP5_POSITION                      equ 0005h
PORTD_SPP5_SIZE                          equ 0001h
PORTD_SPP5_LENGTH                        equ 0001h
PORTD_SPP5_MASK                          equ 0020h
PORTD_SPP6_POSN                          equ 0006h
PORTD_SPP6_POSITION                      equ 0006h
PORTD_SPP6_SIZE                          equ 0001h
PORTD_SPP6_LENGTH                        equ 0001h
PORTD_SPP6_MASK                          equ 0040h
PORTD_SPP7_POSN                          equ 0007h
PORTD_SPP7_POSITION                      equ 0007h
PORTD_SPP7_SIZE                          equ 0001h
PORTD_SPP7_LENGTH                        equ 0001h
PORTD_SPP7_MASK                          equ 0080h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RDPU_POSN                          equ 0007h
PORTE_RDPU_POSITION                      equ 0007h
PORTE_RDPU_SIZE                          equ 0001h
PORTE_RDPU_LENGTH                        equ 0001h
PORTE_RDPU_MASK                          equ 0080h
PORTE_CK1SPP_POSN                        equ 0000h
PORTE_CK1SPP_POSITION                    equ 0000h
PORTE_CK1SPP_SIZE                        equ 0001h
PORTE_CK1SPP_LENGTH                      equ 0001h
PORTE_CK1SPP_MASK                        equ 0001h
PORTE_CK2SPP_POSN                        equ 0001h
PORTE_CK2SPP_POSITION                    equ 0001h
PORTE_CK2SPP_SIZE                        equ 0001h
PORTE_CK2SPP_LENGTH                      equ 0001h
PORTE_CK2SPP_MASK                        equ 0002h
PORTE_OESPP_POSN                         equ 0002h
PORTE_OESPP_POSITION                     equ 0002h
PORTE_OESPP_SIZE                         equ 0001h
PORTE_OESPP_LENGTH                       equ 0001h
PORTE_OESPP_MASK                         equ 0004h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h

